from matplotlib import pyplot as plt

r1000 = [
    0.000614903,
    0.00117728,
    0.00317053,
    0.000486501,
    0.000482077,
    0.00101617,
    0.00114932,
    0.00114712,
    0.015267,
    0.0113708,
    0.00118154,
    0.0183631,
    0.0193859,
    0.00327819,
    0.00132105,
    0.0135773,
    0.00760403,
    0.0265591,
    0.0190077,
    0.0102219,
    0.00852801,
    0.00158723,
    0.00268274,
    0.00476535,
]

r100000 = [
    0.0554712,
    0.0274631,
    0.0236793,
    0.0229555,
    0.0185269,
    0.023183,
    0.0126729,
    0.0138969,
    0.01593,
    0.00983626,
    0.0139928,
    0.0165065,
    0.0126732,
    0.0151195,
    0.0146399,
    0.0386323,
    0.0282546,
    0.0345776,
    0.0492794,
    0.0529393,
    0.0328399,
    0.0449946,
    0.0527,
    0.031949,
]

r10000000 = [
    4.96668,
    2.83807,
    1.92584,
    1.4128,
    1.19617,
    1.04767,
    0.868875,
    0.769548,
    0.739409,
    0.782001,
    0.642511,
    1.07769,
    0.85929,
    0.807511,
    0.738451,
    1.34459,
    1.39524,
    1.32766,
    1.30599,
    1.2797,
    1.46927,
    1.52133,
    1.68343,
    1.5388,
]

X = list(range(3, 49 + 1, 2))

s1000 = [r1000[0] / t for t in r1000]
s100000 = [r100000[0] / t for t in r100000]
s10000000 = [r10000000[0] / t for t in r10000000]

plt.xlabel("Количество процессоров")
plt.ylabel("Время работы, сек.")

plt.title("1000 сообщений")
p = plt.plot(X, r1000, marker="o")
plt.savefig('time1000.png')
p[0].remove()

plt.title("100000 сообщений")
p = plt.plot(X, r100000, marker="o", color="olive")
plt.savefig('time100000.png')
p[0].remove()

plt.title("10000000 сообщений")
p = plt.plot(X, r10000000, marker="o", color="crimson")
plt.savefig('time10000000.png')
p[0].remove()


plt.xlabel("Количество процессоров")
plt.ylabel("Ускорение")

plt.title("1000 сообщений")
p = plt.plot(X, s1000, marker="o")
plt.savefig('speedup1000.png')
p[0].remove()

plt.title("100000 сообщений")
p = plt.plot(X, s100000, marker="o", color="olive")
plt.savefig('speedup100000.png')
p[0].remove()

plt.title("10000000 сообщений")
plt.plot(X, s10000000, marker="o", color="crimson")
plt.savefig('speedup10000000.png')
